#include <iostream>
#include <vector>

using namespace std;
void ex(){
/*
+1.считать 4 числа в червяка
2.число в хвосте червяка-потенциальный минимум зи пройденных
3.сдвинуть все числа в червяке влево
4.считать пятоу число в зубы червыку
5.------------вывести червяка и пройденный минимм для проверки
6.собрать пару из того, что в зубах червяка, и пройденного минимума
7.это кондидат на минииальную пару
8.один зод чераяка закончен, повторяем
*/
int n(0);
cin>>n;
vector<int> num(n,0);
vector<int> worm(4,0);

for (int i(0);i<4;i++)
    cin>>worm[i];
}
int main()
{
    ex();
    return 0;
}
